# Variable Notes

1. pclass: A proxy for socio-economic status (SES)
    1st = Upper
    2nd = Middle
    3rd = Lower

2. age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

3. sibsp: The dataset defines family relations in this way...
4. Sibling = brother, sister, stepbrother, stepsister
5. Spouse = husband, wife (mistresses and fianc√©s were ignored)

6. parch: The dataset defines family relations in this way...
7. Parent = mother, father
8. Child = daughter, son, stepdaughter, stepson
Some children travelled only with a nanny, therefore parch=0 for them

# Data dictionary
1. "survival	Survival	0 = No, 1 = Yes",
2. "pclass	Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd",
3. "sex	Sex	",
4. "Age	Age in years	",
5. "sibsp	# of siblings / spouses aboard the Titanic	",
6. "parch	# of parents / children aboard the Titanic	",
7. "ticket	Ticket number	",
8. "fare	Passenger fare	",
9. "cabin	Cabin number	",
10. "embarked	Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton",

In [14]:
data_dictionary = [
"survival Survival 0 = No, 1 = Yes",
"pclass Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd",
"sex Sex ",
"Age Age in years ",
"sibsp # of siblings / spouses aboard the Titanic ",
"parch # of parents / children aboard the Titanic ",
"ticket Ticket number ",
"fare Passenger fare ",
"cabin Cabin number ",
"embarked Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton",
    ]

In [15]:
data_dictionary

['survival Survival 0 = No, 1 = Yes',
 'pclass Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd',
 'sex Sex ',
 'Age Age in years ',
 'sibsp # of siblings / spouses aboard the Titanic ',
 'parch # of parents / children aboard the Titanic ',
 'ticket Ticket number ',
 'fare Passenger fare ',
 'cabin Cabin number ',
 'embarked Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton']

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
# ttrain - titanic train data
ttrain = pd.read_csv('titanic/train.csv')
ttrain.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
ttrain.shape

(891, 12)

In [30]:
# filter how many survived

### Now lets split out the surname and name from Name column

In [20]:
ttrain.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [23]:
ttrain.Age.max()

80.0

In [24]:
ttrain.Age.min()

0.42

In [28]:
ttrain.Age.duplicated().value_counts()

True     802
False     89
Name: Age, dtype: int64

In [29]:
ttrain.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [50]:
ttrain.Survived[ttrain.Survived == 1].count().sum()

342

In [51]:
891-342

549

In [53]:
ttrain.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [54]:
ttrain.Age.mean()

29.69911764705882

In [ ]:
ttrain.